scripts/jmeter/course-selection-round2-select.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Course Selection Round2 Select enabled="true">
      <stringProp name="TestPlan.comments">闈㈠悜褰撳墠 ROUND2 娲诲姩鐨勭浜岃疆鎶㈣鍘嬫祴銆傞粯璁よ鍙?scripts/jmeter/data/student_accounts.csv锛屽厛鐧诲綍锛屽啀鏌ヨ褰撳墠娲诲姩涓庤绋嬶紝鏈€鍚庡苟鍙戣皟鐢?/api/student/courses/{id}/select锛涗笟鍔″眰鈥滃悕棰濆凡婊?宸叉垚鍔熼€夎鈥濈瓑鎷掔粷浼氳涓烘湁鏁堜笟鍔″搷搴旇€岄潪鑴氭湰澶辫触銆?/stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="鐢ㄦ埛鍙橀噺" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="鐢ㄦ埛瀹氫箟鐨勫彉閲? enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${__P(host,175.24.131.74)}</stringProp>
        <stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp>
        <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">${__P(connectTimeout,10000)}</stringProp>
        <stringProp name="HTTPSampler.response_timeout">${__P(responseTimeout,10000)}</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="璐﹀彿 CSV" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="filename">${__P(accountsCsv,scripts/jmeter/data/student_accounts.csv)}</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">true</boolProp>
        <stringProp name="variableNames">username,password</stringProp>
      </CSVDataSet>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="绗簩杞姠璇剧嚎绋嬬粍" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="寰幆鎺у埗鍣? enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,120)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampUp,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="绗簩杞姠璇炬祦绋? enabled="true">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">false</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 鐧诲綍" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="鐢ㄦ埛瀹氫箟鐨勫彉閲? enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;username&quot;:&quot;${username}&quot;,&quot;password&quot;:&quot;${password}&quot;}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/auth/login</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="鐧诲綍璇锋眰澶? enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json;charset=UTF-8</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Accept</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="鎻愬彇鐧诲綍浠ょ墝" enabled="true">
              <stringProp name="cacheKey">extract-login-token</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

def root = new JsonSlurper().parseText(prev.getResponseDataAsString())
vars.put('loginCode', String.valueOf(root.code))
vars.put('loginMessage', String.valueOf(root.message))
vars.put('token', root?.data?.token ? String.valueOf(root.data.token) : '')
vars.put('mustChangePassword', root?.data?.mustChangePassword == null ? '' : String.valueOf(root.data.mustChangePassword))
prev.setResponseMessage("loginCode=${vars.get('loginCode')}, mustChangePassword=${vars.get('mustChangePassword')}")
              ]]></stringProp>
            </JSR223PostProcessor>
            <hashTree/>
            <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="鏂█-鐧诲綍鎴愬姛" enabled="true">
              <stringProp name="cacheKey">assert-login-ok</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script"><![CDATA[
if (vars.get('loginCode') != '200' || !vars.get('token')) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('鐧诲綍澶辫触: ' + prev.getResponseDataAsString())
}
              ]]></stringProp>
            </JSR223Assertion>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 褰撳墠娲诲姩" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="鐢ㄦ埛瀹氫箟鐨勫彉閲? enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/student/events/current</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="閴存潈璇锋眰澶?褰撳墠娲诲姩" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${token}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Accept</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="鎻愬彇娲诲姩淇℃伅" enabled="true">
              <stringProp name="cacheKey">extract-current-event</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

def root = new JsonSlurper().parseText(prev.getResponseDataAsString())
vars.put('eventCode', String.valueOf(root.code))
vars.put('eventStatus', root?.data?.status ? String.valueOf(root.data.status) : '')
vars.put('eventId', root?.data?.id ? String.valueOf(root.data.id) : '')
vars.put('inRound2', root?.data?.inRound2 == null ? '' : String.valueOf(root.data.inRound2))
prev.setResponseMessage("eventId=${vars.get('eventId')}, eventStatus=${vars.get('eventStatus')}, inRound2=${vars.get('inRound2')}")
              ]]></stringProp>
            </JSR223PostProcessor>
            <hashTree/>
            <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="鏂█-娲诲姩澶勪簬 ROUND2" enabled="true">
              <stringProp name="cacheKey">assert-event-round2</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script"><![CDATA[
if (vars.get('eventCode') != '200' || vars.get('eventStatus') != 'ROUND2' || vars.get('inRound2') != 'true') {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('褰撳墠娲诲姩涓嶅湪 ROUND2: ' + prev.getResponseDataAsString())
}
              ]]></stringProp>
            </JSR223Assertion>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03 鍙€夎绋嬪垪琛? enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="鐢ㄦ埛瀹氫箟鐨勫彉閲? enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/student/courses</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="閴存潈璇锋眰澶?璇剧▼鍒楄〃" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${token}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Accept</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="瑙ｆ瀽鐩爣璇剧▼" enabled="true">
              <stringProp name="cacheKey">resolve-target-course</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

def root = new JsonSlurper().parseText(prev.getResponseDataAsString())
def courses = root?.data ?: []
def targetId = (props.get('targetCourseId') ?: '').trim()
def targetName = (props.get('targetCourseName') ?: '').trim()
if (!targetName) {
    targetName = '瓒崇悆'
}

def matched = null
if (targetId) {
    matched = courses.find { String.valueOf(it.id) == targetId }
}
if (matched == null) {
    matched = courses.find { String.valueOf(it.name) == targetName }
}

vars.put('courseListCode', String.valueOf(root.code))
vars.put('resolvedCourseId', matched == null ? '' : String.valueOf(matched.id))
vars.put('resolvedCourseName', matched == null ? '' : String.valueOf(matched.name))
prev.setResponseMessage("resolvedCourseId=${vars.get('resolvedCourseId')}, resolvedCourseName=${vars.get('resolvedCourseName')}")
              ]]></stringProp>
            </JSR223PostProcessor>
            <hashTree/>
            <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="鏂█-鐩爣璇剧▼瀛樺湪" enabled="true">
              <stringProp name="cacheKey">assert-course-found</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script"><![CDATA[
if (vars.get('courseListCode') != '200' || !vars.get('resolvedCourseId')) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('鐩爣璇剧▼涓嶅瓨鍦ㄦ垨璇剧▼鎺ュ彛澶辫触: ' + prev.getResponseDataAsString())
}
              ]]></stringProp>
            </JSR223Assertion>
            <hashTree/>
          </hashTree>
          <SynchronizingTimer guiclass="TestBeanGUI" testclass="SynchronizingTimer" testname="04 骞跺彂瀵归綈" enabled="true">
            <stringProp name="groupSize">${__P(syncUsers,120)}</stringProp>
            <stringProp name="timeoutInMs">${__P(syncTimeoutMs,15000)}</stringProp>
          </SynchronizingTimer>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="05 鎻愪氦鎶㈣" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="鐢ㄦ埛瀹氫箟鐨勫彉閲? enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/student/courses/${resolvedCourseId}/select</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="閴存潈璇锋眰澶?鎻愪氦鎶㈣" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer ${token}</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Accept</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="璁板綍涓氬姟杩斿洖鐮? enabled="true">
              <stringProp name="cacheKey">extract-select-result</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

def root = new JsonSlurper().parseText(prev.getResponseDataAsString())
vars.put('selectCode', String.valueOf(root.code))
vars.put('selectMessage', root?.message ? String.valueOf(root.message) : '')
if (prev.getResponseCode() == '400' && vars.get('selectCode')) {
    prev.setSuccessful(true)
}
prev.setResponseMessage("bizCode=${vars.get('selectCode')}, bizMessage=${vars.get('selectMessage')}, course=${vars.get('resolvedCourseName')}, student=${vars.get('student_no')}")
              ]]></stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>